import Page from '../layouts/main'

export default () => (
  <Page>
    <p>Snapshot Testing</p>
    <p>ในการทดสอบ ui ของ Presentational component ปกติเรามักจะทดสอบแค่ ui บางส่วน เช่น มี chidren component ถูกต้อง, รับ props มาเท่าไหร่ต้องแสดง ui ให้ครบเท่านั้น ซึ่งจริงๆแล้วก็เพียงพอสำหรับการทดสอบ แต่เราสามารถเพิ่มความแข็งแรงให้กับการทดสอบได้อีก ด้วยการทำ snapshot testing นั่นเอง</p>
    <p>Snapshot testing คือการบันทึก ui เอาไว้ทุกครั้งที่มีการรันเทส เมื่อมีการรันเทสครั้งต่อไปจะมีการเอา snapshot มาเทียบกันเพื่อให้แน่ใจว่าการแก้โค้ดของเราทำให้ ui เปลี่ยนไปจากเดิมหรือไม่</p>
    <p>Snapshot ที่เก็บจะอยู่ในรูปของ text นะครับ ไม่ใช่รูปภาพ</p>
  </Page>
)
